Show / Hide Table of Contents
Enum HingeTypeInDirrection
Type of hinge in the direction
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum HingeTypeInDirrection
Fields
 Name |  Description
 Flexible
Initial stiffness is aplied
 FullHinge
Full hinge, zero stiffness is aplied
 NoHinge
No hinge defined
 Nonlinear
Nonlinear function is aplied
 Improve this Doc
 View Source